-- MySQL dump 10.13  Distrib 8.0.19, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: game_club
-- ------------------------------------------------------
-- Server version	5.7.44

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `apply_club`
--

DROP TABLE IF EXISTS `apply_club`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `apply_club` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `club_id` varchar(36) NOT NULL,
  `apply_user` int(11) NOT NULL,
  `apply_user_name` varchar(64) NOT NULL,
  `apply_time` datetime NOT NULL,
  `apply_result` int(11) NOT NULL DEFAULT '0',
  `apply_user_head_url` varchar(64) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `club_id` (`club_id`,`apply_user`) USING BTREE
) ENGINE=MyISAM AUTO_INCREMENT=128 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `apply_club`
--

LOCK TABLES `apply_club` WRITE;
/*!40000 ALTER TABLE `apply_club` DISABLE KEYS */;
/*!40000 ALTER TABLE `apply_club` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `club_list`
--

DROP TABLE IF EXISTS `club_list`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `club_list` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `club_name` varchar(32) NOT NULL COMMENT '俱乐部名称',
  `create_user` int(11) NOT NULL COMMENT '创建人id',
  `content` varchar(128) DEFAULT '' COMMENT '介绍',
  `club_manage` int(11) DEFAULT '0' COMMENT '管理员',
  `club_id` varchar(32) NOT NULL,
  `user_num` int(11) NOT NULL DEFAULT '0' COMMENT '俱乐部人数',
  `create_user_name` varchar(64) NOT NULL DEFAULT '',
  `create_user_head_url` varchar(128) DEFAULT '',
  `club_manage_name` varchar(64) DEFAULT '',
  `club_manage_head_url` varchar(128) DEFAULT '',
  `table_info` text,
  PRIMARY KEY (`id`),
  UNIQUE KEY `club_id` (`club_id`) USING BTREE
) ENGINE=MyISAM AUTO_INCREMENT=179 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `club_list`
--

LOCK TABLES `club_list` WRITE;
/*!40000 ALTER TABLE `club_list` DISABLE KEYS */;
INSERT INTO `club_list` VALUES (73,'33434',10938,'',0,'5686882',1,'游客0750506','8','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(74,'4343',10936,'',0,'9253383',1,'游客0755904','2','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(75,'32323',11068,'',0,'1810665',1,'游客0822627','9','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(76,'43',10936,'',0,'7053333',1,'游客0755904','2','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(77,'43434',11089,'',0,'9130534',1,'游米棋牌','5','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(78,'放',10760,'',0,'6804372',1,'游客0683006','5','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(79,'323323',11171,'',0,'3183753',1,'游客0869422','1','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(80,'32323',11135,'',0,'6046763',1,'游客0838030','5','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(81,'攻击距离',11176,'',0,'8991722',1,'游客0879102','5','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(82,'4334324',11135,'',0,'4278882',1,'游客0838030','5','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(83,'西湖道',11239,'',0,'2238686',1,'游客0897817','5','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(84,'123',11315,'',0,'0172128',1,'游客0851903','1','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(85,'3213123',11089,'',0,'7425637',1,'游米棋牌','5','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(86,'3232',10703,'',0,'8093457',1,'游客0882502','9','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(87,'trtrt',10717,'',0,'8489481',1,'游客0818816','4','','','{\"ju_shu\":\"2\",\"zhuang\":\"1\",\"bet_max\":\"7\",\"init_gold\":\"8\"}'),(88,'43434',10792,'',0,'3345737',1,'游客0973589','5','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(89,'测试',10822,'',0,'9251330',1,'游客0908724','9','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":\"1\"}'),(90,'32323',10770,'',0,'6823815',1,'游客0900946','3','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(91,'你是我的小号',10858,'',0,'8177412',1,'游客0008206','6','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(92,'323123123',10770,'',0,'1980283',1,'游客0900946','3','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(93,'牌九',10869,'',0,'6258406',1,'游客0032516','5','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(94,'323233',10880,'',0,'7781957',1,'游客0047427','2','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(95,'34343434',10880,'',0,'4640671',1,'游客0047427','2','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(96,'323213',10880,'',0,'7066799',1,'游客0047427','2','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(97,'f\'s\'d\'f\'s\'d\'',10879,'',0,'5637320',1,'游客0046126','5','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(98,'12321',10895,'',0,'8793146',1,'游客0067109','3','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(99,'323',63,'',0,'3059745',1,'游客0153644','4','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(100,'434',10727,'',0,'4117944',1,'游客0199903','1','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(101,'3123213',7,'',0,'5709851',1,'游客0113512','3','','','{\"ju_shu\":0,\"zhuang\":\"1\",\"bet_max\":0,\"init_gold\":0}'),(102,'好好玩',1,'',0,'0918242',1,'游客0107706','4','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(103,'你的要求',17,'',0,'7400248',1,'游客0146122','11','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(104,'我的少女時代',17,'',0,'1388436',1,'游客0146122','11','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(105,'哈林',17,'',0,'4177080',1,'游客0146122','11','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(106,'是是是',10757,'',0,'1756037',1,'游客0191155','9','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(107,'你是我的小号',10706,'',0,'0494587',1,'游客0287805','4','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(108,'好，我都',10706,'',0,'4345207',1,'游客0287805','4','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(109,'我是不是',10717,'小小不言而喻',0,'8166071',1,'游客0297515','5','','','{\"ju_shu\":\"1\",\"zhuang\":0,\"bet_max\":\"7\",\"init_gold\":\"6\"}'),(110,'哈哈斤斤计较',10730,'',0,'7311984',1,'游客0204128','6','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(111,'23213123',10714,'',0,'6151686',1,'游客0281012','9','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(112,'321312',10965,'',0,'3277651',1,'游客0244003','6','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(113,'1445',11069,'',0,'3839943',1,'游客0237548','3','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(114,'3213213',11189,'',0,'6696750',1,'游客1158307','4','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(115,'ttttt',11191,'',0,'4694582',1,'游客1158509','9','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(116,'4444',15,'',0,'1935875',1,'游客1181040','4','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(117,'wewqew',16,'啦啦啦啦',0,'2775014',1,'游客1181241','10','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(118,'321321',10011071,'',0,'5608609',1,'游客1192103','5','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(119,'qwqwq',10011072,'',0,'0442381',1,'游客1192004','2','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(120,'3123123',12717,'',0,'2181194',1,'游客1185225','7','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(121,'2321323',12703,'',0,'0435414',1,'游客1179212','5','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(122,'！！！！',13070,'',0,'3849177',1,'游客1310306','2','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(123,'。。。。。。',15089,'',0,'8206773',1,'USER1409903','5','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(124,'不能',15103,'',15105,'6911172',1,'USER1411806','5','USER1412608','2','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":\"3\",\"init_gold\":\"2\"}'),(125,'111',15102,'',0,'6826576',1,'USER1411605','10','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(126,'321312',15085,'',0,'6417476',1,'USER1408630','1','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(127,'。。。。。',15599,'',0,'4584155',1,'USER1632906','8','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(128,'！！？',15615,'',0,'2149754',1,'USER1675815','4','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(129,'毒舌',15617,'',0,'3381777',1,'USER1676203','8','','','{\"ju_shu\":\"1\",\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(130,'测试',15618,'',0,'4630355',1,'USER1677004','8','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(131,'3213123',15670,'',0,'7518331',1,'游客1716902','8','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(132,'！！！！！',15324,'',0,'8278884',1,'USER1507327','2','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(133,'HAHAH',15085,'联系方式54893605',0,'8826925',1,'USER1408630','1','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(134,'嗯',15860,'',0,'5945954',1,'USER1882208','5','','','{\"ju_shu\":\"0\",\"zhuang\":\"0\",\"bet_max\":\"7\",\"init_gold\":\"8\"}'),(135,'2222',15864,'',0,'4083271',1,'USER1882412','3','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(136,'123456',15953,'',0,'6435215',1,'USER1848211','7','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(137,'iuoipoipio',16066,'',0,'3287476',1,'USER1943211','10','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(138,'323213213',15101,'',0,'4460267',1,'USER1411304','7','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(140,'在一起',15573,'',15581,'0882313',1,'USER1982313','5','USER1992309','1','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(141,'23213231',15085,'',0,'7138782',1,'USER1408630','1','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(142,'321312',15677,'',0,'5160316',1,'USER1024029','4','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(143,'3213213',15697,'',0,'6981476',1,'USER1070102','7','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(144,'2222',15704,'',0,'2555002',1,'USER1085309','7','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(145,'12313',15704,'',0,'2326661',1,'USER1085309','7','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(146,'我的世界',15849,'',0,'1615158',1,'USER1143208','8','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(147,'我的世界',15850,'',0,'6347234',1,'USER1144409','5','','','{\"ju_shu\":\"0\",\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(148,'完美世界',15854,'',0,'4888456',1,'USER1146313','1','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(149,'4324324',15101,'',0,'3980470',1,'USER1411304','7','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(150,'43432434',15911,'maifangka',0,'5313488',1,'USER1134005','3','','','{\"ju_shu\":\"2\",\"zhuang\":\"1\",\"bet_max\":\"3\",\"init_gold\":\"1\"}'),(151,'556456456',15912,'7657567567',0,'5906635',1,'USER1134206','9','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(152,'来了来了',15997,'',0,'8854453',1,'USER1192313','6','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(153,'555',15844,'',0,'6646628',1,'USER1136703','2','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":\"3\",\"init_gold\":\"8\"}'),(154,'11',16081,'',0,'3022702',1,'USER1240639','3','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(155,'反反复复',16247,'',0,'3313774',1,'USER2175317','9','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(156,'嘎嘎嘎嘎嘎嘎嘎嘎嘎嘎嘎嘎',16247,'',0,'2352783',1,'USER2175317','9','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(157,'糊涂虫',16311,'',0,'0576528',1,'USER2179521','6','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(158,'543545435',16491,'',0,'2713845',1,'USER2288509','6','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(159,'4324234',16491,'',0,'0337394',1,'USER2288509','6','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(160,'理解理解',16492,'',0,'3584886',1,'USER2280802','5','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(161,'655756',15592,'',0,'0234566',1,'USER2645102','9','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(162,'98989',15592,'',0,'8154256',1,'USER2645102','9','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(163,'989898989',15592,'',0,'9724310',1,'USER2645102','9','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(164,'434324',15627,'',0,'6452846',1,'USER2677424','6','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(166,'拘俗',15645,'',0,'4276774',1,'USER2682214','5','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(167,'5566',15649,'',0,'4516358',1,'USER2682218','9','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(168,'43432',15747,'',0,'4146045',1,'USER2697812','9','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(169,'哈哈',15755,'',0,'1661868',1,'USER2719709','9','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(170,'111',15757,'',0,'7078808',1,'USER2712011','8','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(171,'兄弟',15766,'',0,'3513312',1,'USER2720620','6','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(172,'123',15764,'',0,'6357480',1,'USER2713418','7','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(173,'34234',16999,'',0,'3936695',1,'USER2967302','5','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(174,'iouoiuoui ',16999,'',0,'7373554',1,'USER2967302','5','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(175,'432423',16999,'',0,'7858642',1,'USER2967302','5','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(176,'kakaka',17297,'',0,'2418811',1,'USER2020725','8','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(177,'6767',17334,'',0,'1588325',1,'USER3742037','7','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}'),(178,'4324234',17334,'',0,'2678822',1,'USER3742037','7','','','{\"ju_shu\":0,\"zhuang\":0,\"bet_max\":0,\"init_gold\":0}');
/*!40000 ALTER TABLE `club_list` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `club_money_record`
--

DROP TABLE IF EXISTS `club_money_record`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `club_money_record` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user_id` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `head` varchar(255) NOT NULL,
  `club_id` varchar(32) NOT NULL,
  `coin` bigint(20) NOT NULL COMMENT '金额变化',
  `type` int(5) NOT NULL COMMENT '1:提款  2:捐献',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=MyISAM AUTO_INCREMENT=16 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `club_money_record`
--

LOCK TABLES `club_money_record` WRITE;
/*!40000 ALTER TABLE `club_money_record` DISABLE KEYS */;
/*!40000 ALTER TABLE `club_money_record` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `club_user_list`
--

DROP TABLE IF EXISTS `club_user_list`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `club_user_list` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `club_id` varchar(32) NOT NULL,
  `user_id` int(11) NOT NULL,
  `user_name` varchar(32) NOT NULL,
  `user_head_url` varchar(128) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `user_id` (`user_id`) USING BTREE
) ENGINE=MyISAM AUTO_INCREMENT=269 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `club_user_list`
--

LOCK TABLES `club_user_list` WRITE;
/*!40000 ALTER TABLE `club_user_list` DISABLE KEYS */;
INSERT INTO `club_user_list` VALUES (145,'5686882',10938,'游客0750506','8'),(146,'9253383',10936,'游客0755904','2'),(147,'1810665',11068,'游客0822627','9'),(148,'7053333',10936,'游客0755904','2'),(149,'9130534',11089,'游米棋牌','5'),(150,'6804372',10760,'游客0683006','5'),(151,'3183753',11171,'游客0869422','1'),(152,'6046763',11135,'游客0838030','5'),(153,'8991722',11176,'游客0879102','5'),(154,'8991722',11185,'游客0874411','8'),(155,'4278882',11135,'游客0838030','5'),(156,'2238686',11239,'游客0897817','5'),(157,'0172128',11315,'游客0851903','1'),(158,'7425637',11089,'游米棋牌','5'),(159,'8093457',10703,'游客0882502','9'),(160,'8489481',10717,'游客0818816','4'),(161,'3345737',10792,'游客0973589','5'),(162,'9251330',10822,'游客0908724','9'),(163,'6823815',10770,'游客0900946','3'),(164,'8177412',10858,'游客0008206','6'),(165,'1980283',10770,'游客0900946','3'),(166,'6258406',10869,'游客0032516','5'),(167,'7781957',10880,'游客0047427','2'),(168,'4640671',10880,'游客0047427','2'),(169,'7066799',10880,'游客0047427','2'),(170,'5637320',10879,'游客0046126','5'),(171,'8793146',10895,'游客0067109','3'),(172,'3059745',63,'游客0153644','4'),(173,'4117944',10727,'游客0199903','1'),(174,'5709851',7,'游客0113512','3'),(175,'5709851',26,'游客0151707','10'),(176,'0918242',1,'游客0107706','4'),(177,'7400248',17,'游客0146122','11'),(178,'1388436',17,'游客0146122','11'),(179,'4177080',17,'游客0146122','11'),(180,'1756037',10757,'游客0191155','9'),(181,'0494587',10706,'游客0287805','4'),(182,'4345207',10706,'游客0287805','4'),(183,'8166071',10717,'游客0297515','5'),(184,'7311984',10730,'游客0204128','6'),(185,'6151686',10714,'游客0281012','9'),(186,'3277651',10965,'游客0244003','6'),(187,'3839943',11069,'游客0237548','3'),(188,'6696750',11189,'游客1158307','4'),(189,'4694582',11191,'游客1158509','9'),(190,'6696750',11193,'游客1166311','2'),(191,'1935875',15,'游客1181040','4'),(192,'1935875',16,'游客1181241','10'),(193,'2775014',16,'游客1181241','10'),(194,'5608609',10011071,'游客1192103','5'),(195,'0442381',10011072,'游客1192004','2'),(196,'2181194',12717,'游客1185225','7'),(197,'0435414',12703,'游客1179212','5'),(198,'3849177',13070,'游客1310306','2'),(199,'8206773',15089,'USER1409903','5'),(200,'6911172',15103,'USER1411806','5'),(201,'6911172',15104,'USER1412107','10'),(202,'6911172',15105,'USER1412608','2'),(203,'6826576',15102,'USER1411605','10'),(204,'6417476',15085,'USER1408630','1'),(205,'4584155',15599,'USER1632906','8'),(206,'2149754',15615,'USER1675815','4'),(207,'3381777',15617,'USER1676203','8'),(208,'4630355',15618,'USER1677004','8'),(209,'7518331',15670,'游客1716902','8'),(210,'8278884',15324,'USER1507327','2'),(211,'8826925',15085,'USER1408630','1'),(212,'5945954',15860,'USER1882208','5'),(213,'4083271',15864,'USER1882412','3'),(214,'4083271',15862,'USER1882310','6'),(215,'6435215',15953,'USER1848211','7'),(216,'3287476',16066,'USER1943211','10'),(217,'4460267',15101,'USER1411304','7'),(218,'4460267',15574,'USER1990402','5'),(220,'0882313',15573,'USER1982313','5'),(222,'0882313',15581,'USER1992309','1'),(224,'7138782',15085,'USER1408630','1'),(225,'5160316',15677,'USER1024029','4'),(226,'6981476',15697,'USER1070102','7'),(227,'6981476',15659,'USER1001311','6'),(228,'2555002',15704,'USER1085309','7'),(229,'2326661',15704,'USER1085309','7'),(230,'1615158',15849,'USER1143208','8'),(231,'6347234',15850,'USER1144409','5'),(232,'6347234',15852,'USER1144211','1'),(233,'6347234',15855,'USER1146714','6'),(234,'4888456',15854,'USER1146313','1'),(235,'4888456',15855,'USER1146714','6'),(236,'3980470',15101,'USER1411304','7'),(237,'5313488',15911,'USER1134005','3'),(238,'5313488',15912,'USER1134206','9'),(239,'5906635',15912,'USER1134206','9'),(240,'8854453',15997,'USER1192313','6'),(241,'6646628',15844,'USER1136703','2'),(242,'3022702',16081,'USER1240639','3'),(243,'3313774',16247,'USER2175317','9'),(244,'2352783',16247,'USER2175317','9'),(245,'0576528',16311,'USER2179521','6'),(246,'0576528',16310,'USER2179520','8'),(247,'2713845',16491,'USER2288509','6'),(248,'0337394',16491,'USER2288509','6'),(249,'3584886',16492,'USER2280802','5'),(250,'0234566',15592,'USER2645102','9'),(251,'8154256',15592,'USER2645102','9'),(252,'9724310',15592,'USER2645102','9'),(253,'6452846',15627,'USER2677424','6'),(255,'4276774',15645,'USER2682214','5'),(256,'4516358',15649,'USER2682218','9'),(257,'4146045',15747,'USER2697812','9'),(258,'1661868',15755,'USER2719709','9'),(259,'7078808',15757,'USER2712011','8'),(260,'3513312',15766,'USER2720620','6'),(261,'6357480',15764,'USER2713418','7'),(262,'6357480',15766,'USER2720620','6'),(263,'3936695',16999,'USER2967302','5'),(264,'7373554',16999,'USER2967302','5'),(265,'7858642',16999,'USER2967302','5'),(266,'2418811',17297,'USER2020725','8'),(267,'1588325',17334,'USER3742037','7'),(268,'2678822',17334,'USER3742037','7');
/*!40000 ALTER TABLE `club_user_list` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_club_num_list`
--

DROP TABLE IF EXISTS `user_club_num_list`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_club_num_list` (
  `user_id` int(11) NOT NULL,
  `club_num` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`user_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_club_num_list`
--

LOCK TABLES `user_club_num_list` WRITE;
/*!40000 ALTER TABLE `user_club_num_list` DISABLE KEYS */;
/*!40000 ALTER TABLE `user_club_num_list` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping routines for database 'game_club'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-02-26 17:08:34
